app/controllers/locations_controller.rb

UPDATE "locations" SET "address" = $1, "latitude" = $2, "longitude" = $3, "updated_at" = $4 WHERE "locations"."id" = $5  [["address", "34th street, manhattan"], ["latitude", 40.7530751], ["longitude", -73.9955315], ["updated_at", 2017-07-27 22:11:18 UTC], ["id", 2]]
---
  def update
    if @location.update(location_params)

SELECT locations.*, 3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((41.8781136 - locations.latitude) * PI() / 180 / 2), 2) + COS(41.8781136 * PI() / 180) * COS(locations.latitude * PI() / 180) * POWER(SIN((-87.6297982 - locations.longitude) * PI() / 180 / 2), 2))) AS distance, MOD(CAST((ATAN2( ((locations.longitude - -87.6297982) / 57.2957795), ((locations.latitude - 41.8781136) / 57.2957795)) * 57.2957795) + 360 AS decimal), 360) AS bearing FROM "locations" WHERE (locations.latitude BETWEEN 41.5886500337783 AND 42.1675771662217 AND locations.longitude BETWEEN -88.01856606488484 AND -87.24103033511516 AND (3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((41.8781136 - locations.latitude) * PI() / 180 / 2), 2) + COS(41.8781136 * PI() / 180) * COS(locations.latitude * PI() / 180) * POWER(SIN((-87.6297982 - locations.longitude) * PI() / 180 / 2), 2)))) BETWEEN 0.0 AND 20) ORDER BY distance ASC
---
  def set_location
    @location = Location.find(params[:id])