app/controllers/scores_controller.rb

  def show
    url = "http://api.openweathermap.org/data/2.5/weather?lat=#{@location.latitude.floor(5)}&lon=#{@location.longitude.floor(5)}&appid=#{Rails.application.secrets.openweathermap_api_key}"
    @response = HTTParty.get(url)
    weather_conditions = @response["weather"]
    @current_weather = weather_conditions[0]["main"]
    if @location.weather_guess.downcase == @current_weather.downcase
      # @score.point_count += 1
      # @score.increment!(:point_count)
      @score.update_attribute(:point_count, @score.point_count+1)
      @score.save
---
UPDATE "scores" SET "point_count" = COALESCE("point_count", 0) + 1 WHERE "scores"."id" IS NULL
INSERT INTO "scores" ("point_count", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["point_count", 1], ["created_at", 2017-08-07 04:48:26 UTC], ["updated_at", 2017-08-07 04:48:26 UTC]]