app/controllers/weather_controller.rb

SELECT  "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def find_location
    @location = Location.find params[:location_id]